<a href="https://colab.research.google.com/github/AmeyVanjare/Advance-Analytics/blob/main/Avocado.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Avocado Dataset

1. Find the date when maximum total volume transaction is done

2. Find the total of bags including both conventional and organic types, for every day and every region ( Hint: use group by)

3. Find the region where maximum total volume of organic avocado were sold in year 2016

In [1]:
import pandas as pd
import datetime

In [2]:
df=pd.read_csv('/content/avocado.csv',index_col=0)
df.head()

         Date  AveragePrice  Total Volume  ...          type  year  region
0  2015-12-27          1.33      64236.62  ...  conventional  2015  Albany
1  2015-12-20          1.35      54876.98  ...  conventional  2015  Albany
2  2015-12-13          0.93     118220.22  ...  conventional  2015  Albany
3  2015-12-06          1.08      78992.15  ...  conventional  2015  Albany
4  2015-11-29          1.28      51039.60  ...  conventional  2015  Albany

[5 rows x 13 columns]

In [ ]:
df.loc[df['Total Volume']==df.max()['Total Volume'],['Date','Total Volume']]

        Date  Total Volume
7 2018-02-04   62505646.52

Answer for Q1 as given below

In [ ]:
df3=df.groupby(['Date'])['Date','Total Volume'].sum()
df3

In [ ]:
dfgroup=df.groupby(['Date','region'])['Small Bags','Large Bags','XLarge Bags','Total Bags']
dfgroup.first()

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  """Entry point for launching an IPython kernel.

                                 Small Bags  ...   Total Bags
Date       region                            ...
2015-01-04 Albany                   9186.93  ...      9716.46
           Atlanta                 16707.15  ...     46815.79
           BaltimoreWashington    137146.07  ...    141136.68
           Boise                    6064.30  ...      7755.62
           Boston                  87406.84  ...     87663.13
...                                     ...  ...          ...
2018-03-25 Syracuse                11836.12  ...     26767.39
           Tampa                   87355.05  ...    145204.84
           TotalUS              12540327.19  ...  16394524.11
           West                  1309580.19  ...   3068508.43
           WestTexNewMexico       153009.89  ...    316055.62

[9126 rows x 4 columns]

In [ ]:
df['Date']=df['Date'].apply(pd.to_datetime,format='%Y-%m-%d')
df['year']=(df['Date']).dt.year
df.head()

        Date  AveragePrice  Total Volume  ...          type  year  region
0 2015-12-27          1.33      64236.62  ...  conventional  2015  Albany
1 2015-12-20          1.35      54876.98  ...  conventional  2015  Albany
2 2015-12-13          0.93     118220.22  ...  conventional  2015  Albany
3 2015-12-06          1.08      78992.15  ...  conventional  2015  Albany
4 2015-11-29          1.28      51039.60  ...  conventional  2015  Albany

[5 rows x 13 columns]

In [ ]:
df['type'].unique()

In [ ]:
df1=df.loc[(df['year']==2016) & (df['type']=='organic')]
df1=df1.loc[df1['Total Volume']==df1.max()['Total Volume'],['region','Total Volume']]
df1.head()

         Date  AveragePrice  Total Volume  ...     type  year   region
35 2016-04-24          1.25    1475457.53  ...  organic  2016  TotalUS

[1 rows x 13 columns]